Tekla Open API Reference for Tekla Structures 2025
DotPrintPaperSize Enumeration
 The paper size.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DotPrintPaperSize
Public Enumeration DotPrintPaperSize
Members
Member name | Value | Description
Auto | 0 |  Printer output type.
A0 | 1 |  A0 paper size.
A1 | 2 |  A1 paper size.
A2 | 3 |  A2 paper size.
A3 | 4 |  A3 paper size.
A4 | 5 |  A4 paper size.
A5 | 6 |  A5 paper size.
See Also
Reference
Tekla.Structures.Drawing Namespace